{
  "dedicate": "Dia dedikasikan",
  "year": "tahun",
  "tobe": "terakhirnya untuk menjadi Frontend Developer.",
  "masteredSkill": "<span class='text-xl lg:text-3xl py-1 px-2 lg:px-3 bg-light-orange-50 text-black'>skill yang dikuasai?</span> Lihat di bawah!",
  "choose": "PILIH IKON",
  "react": "Selama <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>3-4 tahun terakhir</span> sebagai Frontend Web Developer, ReactJS telah menjadi alat andalannya, membantu membangun segala sesuatu mulai dari website yang sleek hingga dashboard yang kompleks. Baik itu proyek sederhana atau tantangan yang rumit, ReactJS selalu menjadi inti dari pekerjaannya.",
  "next": "Next.js telah menjadi favoritnya selama <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>3 tahun terakhir</span>. Dari membangun website dinamis hingga optimasi SEO, Next.js benar-benar mengubah cara dia bekerja. Sekarang, dia sedang mengeksplorasi fitur-fitur terbaru dari <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>Next.js 14</span>, bersemangat untuk mengeksplorasi kemampuan barunya dan mengembangkan proyeknya lebih jauh.",
  "redux": "Redux memulai <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>Pengalaman pertamanya dalam manajemen state global</span>, yang ia gunakan selama <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>2 tahun pertama perjalanannya</span> sebagai Frontend Web Developer. Apa yang dimulai sebagai alat sederhana untuk mengelola state global, kemudian berkembang menjadi menangani tantangan yang lebih kompleks seperti RTK Query. Ini membantunya memahami kompleksitas mendalam dalam manajemen state.",
  "tailwind": "Belakangan ini, TailwindCSS telah menjadi framework favoritnya dan hampir <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>digunakan di semua proyek terbarunya</span>. Pendekatan utility-first memungkinkan dia membangun desain custom dengan cepat dan efisien, tanpa batasan framework CSS tradisional.",
  "typescript": "Selama <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>3 tahun terakhir</span>, TypeScript telah menjadi pilar dalam toolkit pengembangannya. Dengan sistem typing yang kuat dan ketat, TypeScript secara signifikan meningkatkan kualitas dan pemeliharaan kodenya.",
  "bootstrap": "Di awal perjalanan frontend-nya, Bootstrap adalah toolkit andalannya. Bootstrap memberikan fondasi yang kuat untuk membangun website yang responsif dan menarik secara visual dengan mudah. Seiring dengan kemajuan keterampilannya, Bootstrap tidak hanya menjadi framework, tetapi juga menjadi perkenalannya dengan sistem desain yang terstruktur dan skalabel.",
  "jest": "Selama <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>2 tahun terakhir</span>, Jest telah menjadi framework testing andalannya. Dipadukan dengan <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>React Testing Library</span>, Jest menyederhanakan pendekatannya dalam menulis unit test dan integration test yang andal. Alat-alat ini memberikan keyakinan bahwa kodenya siap untuk produksi dengan kualitas tinggi dan bebas dari bug.",
  "storybook": "Meskipun ia menggunakan Storybook <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>lebih jarang</span>, ia menghargai nilai yang diberikannya dalam proses pengembangan. Storybook menawarkan lingkungan yang kuat untuk membangun dan menguji komponen UI secara terisolasi, membantu menjaga konsistensi dan kualitas desain. Saat digunakan, Storybook meningkatkan alur kerjanya dan menambahkan lapisan kepercayaan pada pengembangan UI.",
  "zustand": "Zustand menjadi <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>solusi manajemen state yang membuatnya berpindah dari Redux</span>. Kesederhanaan dan minimnya boilerplate membuatnya lebih intuitif dan fleksibel dalam mengelola state. Zustand cepat, skalabel, dan benar-benar mengubah cara dia menangani state dalam aplikasinya.",
  "reactQuery": "React Query menjadi <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>andalan utamanya</span> untuk fetching data dan sinkronisasi, membuatnya <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>berpindah dari RTK Query</span>. Fitur-fitur kuat untuk mengelola server state dan caching, dipadukan dengan API yang sederhana, telah menyederhanakan penanganan datanya dan meningkatkan performa proyek-proyeknya."
}
