{
  "dedicate": "He dedicated his last",
  "year": "years",
  "tobe": "to be Frontend Developer.",
  "masteredSkill": "<span class='text-xl lg:text-3xl py-1 px-2 lg:px-3 bg-light-orange-50 text-black'>mastered skills?</span> Look down below!",
  "choose": "CHOOSE THE ICON",
  "react": "For the past <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>3-4 years</span> as a Frontend Web Developer, ReactJS has been his go-to tool, helping him build everything from sleek websites to complex dashboards. Whether it's simple projects or mind-bending challenges, ReactJS has been at the heart of his work.",
  "next": "Next.js has been his favorite for <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>the past 3 years</span>. From building dynamic websites to SEO optimization, it's been a game-changer in his development process. Now, he's diving into the latest features of <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>Next.js 14</span>, eager to explore its new capabilities and take his projects even further.",
  "redux": "His <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>first dive into global state management</span> started with Redux, which he used during the <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>first 2 years of his journey</span> as a Frontend Web Developer. What began as a simple tool for managing global state soon evolved into tackling more complex challenges, like RTK Query. It was helping him understand the deeper intricacies of state management.",
  "tailwind": "Lately, TailwindCSS has become his go-to framework and a new favorite, almost <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>used in all his current projects</span>. Its utility-first approach allows him to build custom designs quickly and efficiently, without the limitations of traditional CSS frameworks.",
  "typescript": "For <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>the past 3 years</span>, TypeScript has been a cornerstone of his development toolkit. Its strong typing and robust type system have significantly improved code quality and maintainability.",
  "bootstrap": "In the early days of his frontend journey, Bootstrap was his trusted toolkit. It provided a solid foundation for building responsive, visually appealing websites with ease. As he honed his skills, Bootstrap became more than just a framework—it was his introduction to structured, scalable design systems.",
  "jest": "For <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>the past 2 years</span>, Jest has been his go-to testing framework. Paired with <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>React Testing Library</span>, it’s streamlined his approach to writing reliable unit and integration tests. These tools give him the confidence that his code is solid and ready for production, ensuring each project is both high-quality and bug-free.",
  "storybook": "Though he use Storybook <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>less frequently</span>, he appreciate its value in his development process. It offers a powerful environment for building and testing UI components in isolation, helping him ensure consistency and design quality. When he do use it, Storybook enhances his workflow and adds a layer of confidence to his UI development.",
  "zustand": "Zustand became <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>the state management solution that made him move away from Redux</span>. Its simplicity and minimal boilerplate allow for a more intuitive and flexible approach to managing state. It’s fast, scalable, and has completely transformed the way he handle state in his applications.",
  "reactQuery": "React Query became <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>his go-to</span> for data fetching and synchronization, leading him to <span class='py-1 px-2 bg-pumpkin-100 font-normal text-white'>move away from RTK Query</span>. Its powerful features for managing server state and caching, combined with a straightforward API, have streamlined his data handling and improved performance across his projects."
}
