{
  "lereroLms": "Di Lerero, dia memainkan peran penting dalam memelihara dan mengembangkan fitur baru untuk LMS. Salah satu kontribusi signifikan yang dibuatnya adalah pembuatan fitur <span class=\"py-1 px-2 bg-carribean-50 text-white\">manajemen pengguna</span>, yang terdiri dari <span class=\"py-1 px-2 bg-carribean-50 text-white\">5 jenis akses</span>, masing-masing menawarkan lebih dari <span class=\"py-1 px-2 bg-carribean-50 text-white\">60 aksi yang dapat dipilih</span>. Dia juga fokus pada peningkatan modul kursus dan fitur aktivitas, termasuk <span class=\"py-1 px-2 bg-carribean-50 text-white\">integrasi SCORM</span>. Dengan memanfaatkan praktik terbaik, dia menggunakan <span class=\"py-1 px-2 bg-carribean-50 text-white\">Custom Hooks</span> untuk pengembangan fitur dan menerapkan pengujian unit dengan <span class=\"py-1 px-2 bg-carribean-50 text-white\">JEST dan React Testing Library</span>, mencapai cakupan minimal <span class=\"py-1 px-2 bg-carribean-50 text-white\">80%</span>.",
  "lereroMarketplace": "Di Lerero, dia bertanggung jawab untuk memelihara dan mengembangkan fitur baru untuk Marketplace yang sepenuhnya <span class=\"py-1 px-2 bg-carribean-50 text-white\">responsif</span>. Salah satu fitur utama adalah integrasi dengan <span class=\"py-1 px-2 bg-carribean-50 text-white\">Stripe</span> untuk memudahkan proses pembayaran. Dengan menggunakan praktik terbaik dalam pengembangan, dia menerapkan <span class=\"py-1 px-2 bg-carribean-50 text-white\">Custom Hooks</span> untuk menciptakan fitur yang efisien dan mudah dipelihara. Selain itu, dia juga memelihara fitur <span class=\"py-1 px-2 bg-carribean-50 text-white\">checkout, kategori, dan keranjang</span> untuk meningkatkan pengalaman pengguna secara keseluruhan. Dia bekerja dalam lingkungan <span class=\"py-1 px-2 bg-carribean-50 text-white\">Scrum</span>, berkolaborasi dengan tim untuk mencapai tujuan sprint secara efektif.<br/><br/>Sebagai bagian dari proses pengembangan, dia memastikan kualitas kode dengan menerapkan pengujian unit menggunakan <span class=\"py-1 px-2 bg-carribean-50 text-white\">JEST dan React Testing Library</span>, mencapai cakupan minimal <span class=\"py-1 px-2 bg-carribean-50 text-white\">80%</span>. Dengan pendekatan ini, dia memastikan bahwa setiap fitur tidak hanya berfungsi dengan baik tetapi juga dapat diandalkan, menjadikannya aset berharga bagi tim di Lerero."
}
