{
  "titleOne": "different companies",
  "mean": "means",
  "different": "different",
  "titleTwo": "industry knowlegdes",
  "titleThree": "business type",
  "click": "click each item to see more information",
  "rekalogi": "Rekalogi is a dynamic software house based in Bandung, where he had the opportunity to <span class='py-1 px-2 bg-carribean-10 text-white'>intern as a Project Manager</span>. During his time there, he gained hands-on experience in managing projects and learned about the <span class='py-1 px-2 bg-carribean-10 text-white'>result-based management system</span>. It was a pivotal experience that deepened his understanding of project workflows and effective outcome-driven strategies.",
  "docheck": "At DoCheck, he built the  <span class='py-1 px-2 bg-carribean-10 text-white'>admin dashboard from the scratch</span> using <span class='py-1 px-2 bg-carribean-10 text-white'>ReactJS and TypeScript</span> to manage the to-do list app. He also managed and optimized the company profile on <span class='py-1 px-2 bg-carribean-10 text-white'>WordPress</span>, implementing <span class='py-1 px-2 bg-carribean-10 text-white'>SEO</span> strategies and integrating <span class='py-1 px-2 bg-carribean-10 text-white'>Google Analytics</span> to boost visibility and user engagement. His work not only streamlined backend operations but also elevated the company's online presence and performance.",
  "avana": "At Avana, a social commerce company based in <span class='py-1 px-2 bg-carribean-10 text-white'>Malaysia</span>, he managed and enhanced <span class='py-1 px-2 bg-carribean-10 text-white'>3</span> websites using <span class='py-1 px-2 bg-carribean-10 text-white'>ReactJS, Redux, and Bulma</span> within a <span class='py-1 px-2 bg-carribean-10 text-white'>Scrum</span> framework with 2-week sprint cycles. He played a key role in <span class='py-1 px-2 bg-carribean-10 text-white'>integrating shipping</span> functionalities with third-party services and created a comprehensive component library using <span class='py-1 px-2 bg-carribean-10 text-white'>Storybook</span>. These contributions improved site performance and user experience.",
  "lerero": "At Lerero, an educational company with bases in <span class='py-1 px-2 bg-carribean-10 text-white'>Romania and Australia</span>, he was part of the <span class='py-1 px-2 bg-carribean-10 text-white'>Scrum</span> development team. He was responsible for two websites; <span class='py-1 px-2 bg-carribean-10 text-white'>Learning Management System (LMS) and Marketplace</span>. He utilized <span class='py-1 px-2 bg-carribean-10 text-white'>Next.js and styled-components</span> in his work, and applied <span class='py-1 px-2 bg-carribean-10 text-white'>custom hooks</span> as a coding pattern to enhance functionality and maintainability.",
  "detail": "View detail"
}
