{
  "titleOne": "perusahaan berbeda",
  "mean": "artinya",
  "different": "berbeda",
  "titleTwo": "pengetahuan industri",
  "titleThree": "tipe bisnis",
  "click": "klik setiap item untuk melihat informasi lebih lanjut.",
  "rekalogi": "Rekalogi adalah sebuah software house dinamis yang berbasis di Bandung, di mana dia mendapatkan kesempatan untuk <span class='py-1 px-2 bg-carribean-50 text-white'>magang sebagai Project Manager</span>. Selama berada di sana, dia memperoleh pengalaman langsung dalam mengelola proyek dan mempelajari <span class='py-1 px-2 bg-carribean-50 text-white'>sistem manajemen berbasis hasil</span>. Pengalaman ini menjadi momen penting yang memperdalam pemahamannya tentang alur kerja proyek dan strategi efektif yang berfokus pada hasil.",
  "docheck": "Di DoCheck, dia membangun <span class='py-1 px-2 bg-carribean-50 text-white'>dashboard admin dari awal</span> menggunakan <span class='py-1 px-2 bg-carribean-50 text-white'>ReactJS dan TypeScript</span> untuk mengelola aplikasi to-do list. Dia juga mengelola dan mengoptimalkan profil perusahaan di <span class='py-1 px-2 bg-carribean-50 text-white'>WordPress</span>, menerapkan strategi <span class='py-1 px-2 bg-carribean-50 text-white'>SEO</span>, serta mengintegrasikan <span class='py-1 px-2 bg-carribean-50 text-white'>Google Analytics</span> untuk meningkatkan visibilitas dan keterlibatan pengguna. Pekerjaannya tidak hanya merampingkan operasi backend tetapi juga meningkatkan kehadiran dan kinerja online perusahaan.",
  "avana": "Di Avana, sebuah perusahaan social commerce yang berbasis di <span class='py-1 px-2 bg-carribean-50 text-white'>Malaysia</span>, dia mengelola dan meningkatkan <span class='py-1 px-2 bg-carribean-50 text-white'>3</span> situs web menggunakan <span class='py-1 px-2 bg-carribean-50 text-white'>ReactJS, Redux, dan Bulma</span> dalam kerangka kerja <span class='py-1 px-2 bg-carribean-50 text-white'>Scrum</span> dengan siklus sprint 2 minggu. Dia berperan penting dalam <span class='py-1 px-2 bg-carribean-50 text-white'>mengintegrasikan pengiriman</span> dengan layanan pihak ketiga dan membuat perpustakaan komponen lengkap menggunakan <span class='py-1 px-2 bg-carribean-50 text-white'>Storybook</span>. Kontribusinya meningkatkan kinerja situs dan pengalaman pengguna.",
  "lerero": "Di Lerero, sebuah perusahaan pendidikan yang berbasis di <span class='py-1 px-2 bg-carribean-50 text-white'>Rumania dan Australia</span>, dia menjadi bagian dari tim pengembangan <span class='py-1 px-2 bg-carribean-50 text-white'>Scrum</span>. Dia bertanggung jawab atas dua situs web; <span class='py-1 px-2 bg-carribean-50 text-white'>Learning Management System (LMS) dan Marketplace</span>. Dia menggunakan <span class='py-1 px-2 bg-carribean-50 text-white'>Next.js dan styled-components</span> dalam pekerjaannya, serta menerapkan <span class='py-1 px-2 bg-carribean-50 text-white'>custom hooks</span> sebagai pola pengkodean untuk meningkatkan fungsionalitas dan pemeliharaan.",
  "detail": "Lihat detail"
}
